In [1]:
import pandas as pd
        
df1 = pd.read_csv('Top 100 Greatest Hollywood Actors of All Time.csv')
df1

,Name,Date of Birth,Place of Birth,Oscars,Oscar Nominations,BAFTA,BAFTA Nominations,Golden Globes,Golden Globe Nominations,Greatest Performances
0,Al Pacino,25 April 1940,"East Harlem, New York, United States",1,8,2,5,4,15,"Serpico, Scent of a Woman, Dog Day Afternoon, ..."
1,Alan Arkin,26 March 1934,"Brooklyn, New York, United States",1,4,1,3,1,6,"Argo, Little Miss Sunshine, The Heart Is a Lon..."
2,Alan Rickman,21 February 1946,"Hammersmith, London, United Kingdom",0,0,1,4,1,1,"Michael Collins, Truly Madly Deeply, Sense and..."
3,Albert Finney,9 May 1936,"Charlestown, Salford, United Kingdom",0,5,2,13,2,9,"The Murder on the orient Express, The Dresser,..."
4,Alec Guinness,2 April 1914,"Maida Vale, London, United Kingdom",1,5,3,7,1,3,"Star Wars, Little Dorrit, The Bridge on the Ri..."
...,...,...,...,...,...,...,...,...,...,...
95,Tom Hanks,9 July 1956,"Concord, California, United States",2,5,0,4,4,8,"Cast Away, Forrest Gump, Philadelphia, Saving ..."
96,Tommy Lee Jones,15 September 1946,"San Saba, Texas, United States",1,4,0,4,1,4,"In the Valley of Elah, Lincoln, The Fugitive"
97,Will Smith,25 September 1968,"Philadelphia, Pennsylvania, United States",0,2,0,0,0,5,"The Pursuit of Happiness, Ali, Concussion"
98,William Holden,17 April 1918,"O'Fallon, Illinois, United States",1,3,0,2,0,0,"Network, Stalag 17, Sunset Blvd."
99,Woody Allen,30 November 1935,Mount Eden Hospital,4,24,9,23,2,13,"Annie Hall, Manhattan, Take the Money and Run"

In [2]:
print(df1.columns)

Index(['Name', 'Date of Birth', 'Place of Birth', 'Oscars',
       'Oscar Nominations', 'BAFTA', 'BAFTA Nominations', 'Golden Globes',
       'Golden Globe Nominations', 'Greatest Performances'],
      dtype='object')

In [3]:
columns_to_drop = ['Oscars', 'Oscar Nominations', 'BAFTA', 'BAFTA Nominations', 'Golden Globes', 'Golden Globe Nominations', 'Greatest Performances']
df1.drop(columns=columns_to_drop, inplace=True)
print(df1)

               Name      Date of Birth  \
0         Al Pacino      25 April 1940
1        Alan Arkin      26 March 1934
2      Alan Rickman   21 February 1946
3     Albert Finney         9 May 1936
4     Alec Guinness       2 April 1914
..              ...                ...
95        Tom Hanks        9 July 1956
96  Tommy Lee Jones  15 September 1946
97       Will Smith  25 September 1968
98   William Holden      17 April 1918
99      Woody Allen   30 November 1935

                               Place of Birth
0        East Harlem, New York, United States
1           Brooklyn, New York, United States
2         Hammersmith, London, United Kingdom
3        Charlestown, Salford, United Kingdom
4          Maida Vale, London, United Kingdom
..                                        ...
95         Concord, California, United States
96             San Saba, Texas, United States
97  Philadelphia, Pennsylvania, United States
98          O'Fallon, Illinois, United States
99                        Mount Eden Hospital

[100 rows x 3 columns]

In [4]:
# Split 'Name' column into 'User_F_Name' and 'User_L_Name'
df1[['User_F_Name', 'User_L_Name']] = df1['Name'].str.split(' ', n=1, expand=True)

# Drop the original 'Name' column
df1.drop(columns=['Name'], inplace=True)

# Print the modified DataFrame
print(df1)

        Date of Birth                             Place of Birth User_F_Name  \
0       25 April 1940       East Harlem, New York, United States          Al
1       26 March 1934          Brooklyn, New York, United States        Alan
2    21 February 1946        Hammersmith, London, United Kingdom        Alan
3          9 May 1936       Charlestown, Salford, United Kingdom      Albert
4        2 April 1914         Maida Vale, London, United Kingdom        Alec
..                ...                                        ...         ...
95        9 July 1956         Concord, California, United States         Tom
96  15 September 1946             San Saba, Texas, United States       Tommy
97  25 September 1968  Philadelphia, Pennsylvania, United States        Will
98      17 April 1918          O'Fallon, Illinois, United States     William
99   30 November 1935                        Mount Eden Hospital       Woody

   User_L_Name
0       Pacino
1        Arkin
2      Rickman
3       Finney
4     Guinness
..         ...
95       Hanks
96   Lee Jones
97       Smith
98      Holden
99       Allen

[100 rows x 4 columns]

In [5]:
# Convert 'Date of Birth' column to datetime format
df1['Date of Birth'] = pd.to_datetime(df1['Date of Birth'])

# Convert datetime format to 'DD/MM/YYYY' string format
df1['Date of Birth'] = df1['Date of Birth'].dt.strftime('%d/%m/%Y')

# Print the modified DataFrame
print(df1)

   Date of Birth                             Place of Birth User_F_Name  \
0     25/04/1940       East Harlem, New York, United States          Al
1     26/03/1934          Brooklyn, New York, United States        Alan
2     21/02/1946        Hammersmith, London, United Kingdom        Alan
3     09/05/1936       Charlestown, Salford, United Kingdom      Albert
4     02/04/1914         Maida Vale, London, United Kingdom        Alec
..           ...                                        ...         ...
95    09/07/1956         Concord, California, United States         Tom
96    15/09/1946             San Saba, Texas, United States       Tommy
97    25/09/1968  Philadelphia, Pennsylvania, United States        Will
98    17/04/1918          O'Fallon, Illinois, United States     William
99    30/11/1935                        Mount Eden Hospital       Woody

   User_L_Name
0       Pacino
1        Arkin
2      Rickman
3       Finney
4     Guinness
..         ...
95       Hanks
96   Lee Jones
97       Smith
98      Holden
99       Allen

[100 rows x 4 columns]